-- phpMyAdmin SQL Dump
-- version 4.9.1
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Mar 19, 2020 at 08:08 PM
-- Server version: 10.3.20-MariaDB
-- PHP Version: 7.2.24

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `sirkysco_khaoyai`
--
CREATE DATABASE IF NOT EXISTS `sirkysco_khaoyai` DEFAULT CHARACTER SET latin1 COLLATE latin1_swedish_ci;
USE `sirkysco_khaoyai`;

-- --------------------------------------------------------

--
-- Table structure for table `counter`
--

DROP TABLE IF EXISTS `counter`;
CREATE TABLE `counter` (
  `DATE` date NOT NULL,
  `IP` varchar(30) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Dumping data for table `counter`
--

INSERT INTO `counter` (`DATE`, `IP`) VALUES
('2020-03-19', '223.204.236.7');

-- --------------------------------------------------------

--
-- Table structure for table `daily`
--

DROP TABLE IF EXISTS `daily`;
CREATE TABLE `daily` (
  `DATE` date NOT NULL,
  `NUM` varchar(3) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Dumping data for table `daily`
--

INSERT INTO `daily` (`DATE`, `NUM`) VALUES
('2020-01-24', '0'),
('2020-01-25', '1'),
('2020-01-26', '2'),
('2020-01-27', '1'),
('2020-01-28', '2'),
('2020-01-29', '3'),
('2020-01-30', '3'),
('2020-02-04', '0'),
('2020-02-05', '1'),
('2020-02-06', '2'),
('2020-02-07', '1'),
('2020-02-08', '1'),
('2020-02-09', '2'),
('2020-02-10', '2'),
('2020-02-11', '2'),
('2020-02-12', '1'),
('2020-02-13', '2'),
('2020-02-14', '3'),
('2020-02-15', '28'),
('2020-02-17', '0'),
('2020-02-18', '2'),
('2020-02-19', '1'),
('2020-02-20', '3'),
('2020-02-21', '5'),
('2020-02-26', '0'),
('2020-02-27', '1'),
('2020-03-03', '0'),
('2020-03-11', '0'),
('2020-03-18', '0');

-- --------------------------------------------------------

--
-- Table structure for table `help`
--

DROP TABLE IF EXISTS `help`;
CREATE TABLE `help` (
  `id` int(10) NOT NULL,
  `latitude` float NOT NULL,
  `longitude` float NOT NULL,
  `Tel` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  `name` varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  `description` varchar(200) CHARACTER SET utf8 NOT NULL,
  `Used` enum('Yes','No') COLLATE utf8_unicode_ci NOT NULL DEFAULT 'Yes',
  `date` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `help`
--

INSERT INTO `help` (`id`, `latitude`, `longitude`, `Tel`, `name`, `description`, `Used`, `date`) VALUES
(296, 14.1434, 101.354, '0955120247', 'Pokkatess', 'dbbbbb', 'No', NULL),
(297, 14.1543, 101.365, '0955120247', 'Pokkatess', 'hhhhh', 'No', NULL),
(298, 14.1434, 101.354, '0955120247', 'pokkate', '14:54', 'No', NULL),
(299, 13.7234, 100.476, '111111', 'TeeColdly', 'ช่วยด้วย', 'Yes', NULL),
(300, 14.1542, 101.365, '0970963751', 'pokkate', 'test26/1', 'Yes', '2020-01-26 16:04:48'),
(304, 14.1434, 101.354, '', '', '', 'Yes', '2020-02-16 03:33:47'),
(305, 14.1434, 101.354, '2', '16', '2563', 'Yes', '2020-02-16 03:37:27'),
(306, 14.1434, 101.354, 'hh', 'gg', 'hhhh', 'Yes', '2020-02-16 03:40:26'),
(307, 0, 0, '095', '16/2', 'ทอสอบ', 'Yes', '2020-02-16 16:06:30'),
(308, 14.1434, 101.354, '0830819644', 'ทดสอย', '16/2', 'Yes', '2020-02-16 16:07:16'),
(309, 14.1584, 101.345, '0955120247', 'ปกเกศ', 'รถเสีย', 'Yes', '2020-02-21 10:10:56'),
(310, 14.1586, 101.345, '0955120247', 'ทดสอบ 10:45', 'ทดสอบ', 'Yes', '2020-02-21 10:45:31'),
(311, 13.7234, 100.476, '0835515951', 'calenonna', 'ขอตังกินข้าวหน่อยหิวข้าว', 'Yes', '2020-02-21 11:44:00'),
(312, 14.1587, 101.345, '0955120247', 'ปกเกศ', 'ทดสอบ', 'Yes', '2020-02-21 12:10:53'),
(313, 14.1541, 101.365, '', '', 'ขอความช่วยเหลือ', 'Yes', '2020-03-19 15:19:20');

-- --------------------------------------------------------

--
-- Table structure for table `locations`
--

DROP TABLE IF EXISTS `locations`;
CREATE TABLE `locations` (
  `id` int(11) NOT NULL,
  `lat` float(10,6) NOT NULL,
  `lng` float(10,6) NOT NULL,
  `description` varchar(200) COLLATE utf8_unicode_ci NOT NULL,
  `location_status` tinyint(1) DEFAULT 1,
  `Type` varchar(2) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `locations`
--

INSERT INTO `locations` (`id`, `lat`, `lng`, `description`, `location_status`, `Type`) VALUES
(62, 14.341423, 101.345634, 'โป่งอาจารย์แมว', 1, '1'),
(63, 14.341875, 101.349037, 'โค้งอันตราย', 1, '2'),
(65, 14.333646, 101.359474, 'โค้งอันตราย', 1, '2'),
(66, 14.266386, 101.387619, 'โค้งอันตราย', 1, '2'),
(67, 14.279803, 101.392433, 'โค้งอันตราย', 1, '2'),
(68, 14.472023, 101.393440, 'โค้งอันตราย', 1, '2'),
(69, 14.480073, 101.385300, 'โค้งอันตราย', 1, '2'),
(70, 14.484731, 101.386711, 'โค้งอันตราย', 1, '2'),
(72, 14.487773, 101.388512, 'โค้งอันตราย', 1, '2'),
(73, 14.489711, 101.386856, 'โค้งอันตราย', 1, '2'),
(74, 14.425681, 101.391273, 'โค้งอันตราย', 1, '2'),
(75, 14.425468, 101.393478, 'โค้งอันตราย', 1, '2'),
(76, 14.430225, 101.398727, 'โค้งอันตราย', 1, '2'),
(77, 14.434117, 101.400108, 'โค้งอันตราย', 1, '2'),
(78, 14.434989, 101.402565, 'โค้งอันตราย', 1, '2'),
(79, 14.437709, 101.406586, 'โค้งอันตราย', 1, '2'),
(80, 14.432988, 101.414291, 'โค้งอันตราย', 1, '2'),
(81, 14.430735, 101.381180, 'โค้งอันตราย', 1, '2'),
(82, 14.472490, 101.392441, 'โป่ง', 1, '1'),
(83, 14.474470, 101.388031, 'โป่ง กม.30', 1, '1'),
(84, 14.452800, 101.369705, 'โป่งชมรมเพื่อน', 1, '1'),
(85, 14.446921, 101.367180, 'วังจำปี', 1, '3'),
(86, 14.443535, 101.369102, 'โป่งต้นไทร', 1, '1'),
(87, 14.420747, 101.371033, 'ทุ่งกวาง', 1, '1'),
(88, 14.365461, 101.349113, 'โป่งผาตะแบก', 1, '1'),
(89, 14.362061, 101.345634, 'โป่งผาตะแบก', 1, '1'),
(90, 14.313212, 101.377708, 'ดงยาง', 1, '1'),
(92, 14.384454, 101.384430, 'ทุ่งหญ้าเขาเขียว', 1, '1'),
(93, 14.380730, 101.391922, 'โค้งอันตราย', 1, '2'),
(94, 14.373959, 101.407707, 'โค้งอันตราย', 1, '2'),
(95, 14.375573, 101.408386, 'โค้งอันตราย', 1, '2'),
(96, 14.375757, 101.409790, 'โค้งอันตราย', 1, '2'),
(97, 14.367304, 101.406647, 'โค้งอันตราย', 1, '2'),
(98, 14.368991, 101.405258, 'โค้งอันตราย', 1, '2'),
(100, 14.438414, 101.371658, 'ห้องน้ำ', 1, '12'),
(101, 14.438374, 101.371712, 'ร้านกาแฟ', 1, '15'),
(102, 14.438122, 101.371956, 'ลานจอดรถ', 1, '5'),
(103, 14.438153, 101.372475, 'ลานจอดรถ', 1, '5'),
(104, 14.438204, 101.372612, 'ห้องน้ำ', 1, '12'),
(105, 14.438654, 101.372475, 'ที่ทำการอุทยานแห่งชาติ', 1, '4'),
(106, 14.439236, 101.372238, 'ศูนย์บริการนักท่องเที่ยว', 1, '4'),
(107, 14.439223, 101.371765, 'ลานจอดรถ', 1, '5'),
(108, 14.439584, 101.372040, 'เส้นทางศึกษาธรรมชาติน้ำตกกองแก้ว', 1, '13'),
(109, 14.439371, 101.372581, 'ร้านกาแฟ', 1, '15'),
(110, 14.451069, 101.367287, 'ลานจอดรถ', 1, '5'),
(111, 14.450996, 101.367668, 'หนองผังชี', 1, '6'),
(112, 14.452211, 101.368690, 'ลานจอดรถ', 1, '5'),
(113, 14.463618, 101.371254, 'เส้นทางศึกษาธรรมชาติ กม.33 - หนองผักชี', 1, '13'),
(114, 14.473835, 101.390144, 'จุดชมวิว กม.30', 1, '6'),
(115, 14.473677, 101.390259, 'ลานจอดรถ', 1, '5'),
(116, 14.506465, 101.379906, 'ศาลเจ้าพ่อเขาใหญ่', 1, '10'),
(117, 14.505856, 101.380127, 'ลานจอดรถ', 1, '5'),
(118, 14.507735, 101.378967, 'ด่านตรวจศาลเจ้าพ่อเขาใหญ่', 1, '11'),
(119, 14.508169, 101.378479, 'ลานจอดรถ', 1, '5'),
(120, 14.508191, 101.378990, 'ศูนย์บริการนัทท่องเที่ยว', 1, '4'),
(121, 14.508434, 101.378685, 'ลานจอดรถ', 1, '5'),
(122, 14.437917, 101.373672, 'บ้านพักโซน 1 (กองแก้ว)', 1, '9'),
(123, 14.436800, 101.372414, 'เส้นทางศึกษาธรรมชาติ ดงติ้ว - หนองผักชี', 1, '13'),
(124, 14.433629, 101.373924, 'ลานกางเต้นท์เขาร่ม', 1, '8'),
(125, 14.434408, 101.374252, 'ลานจอดรถ', 1, '5'),
(126, 14.434678, 101.375320, 'ห้องน้ำ', 1, '12'),
(127, 14.434204, 101.379097, 'ค่ายสุรัสวดี', 1, '9'),
(128, 14.434358, 101.380478, 'บ้านพักโซน 3 (ค่ายรัสวดี)', 1, '9'),
(129, 14.434431, 101.384865, 'บ้านพักโซน 2 (ทิวทัศน์)', 1, '9'),
(130, 14.423757, 101.385162, 'ลานจอดรถ', 1, '5'),
(131, 14.423004, 101.384659, 'ลานจอดรถ', 1, '5'),
(132, 14.422984, 101.386444, 'ลานจอดรถ', 1, '5'),
(133, 14.423119, 101.387054, 'ลานกางเต้นท์ลำตะคอง', 1, '8'),
(134, 14.423595, 101.387177, 'ร้านกาแฟเขาใหญ่', 1, '15'),
(135, 14.423451, 101.387405, 'ร้านอาหารลานกางเต้นท์ลำตะคอง', 1, '15'),
(136, 14.430270, 101.399918, 'ร้านอาหารผากล้วยไม้', 1, '15'),
(137, 14.431286, 101.400360, 'ลานจอดรถ', 1, '5'),
(138, 14.430694, 101.400879, 'เส้นทางศึกษาธรรมชาติผากล้วยไม้-น้ำตกเหวสุวัต', 1, '13'),
(139, 14.431430, 101.400414, 'ลานกางเต้นท์ผากล้วยไม้', 1, '8'),
(140, 14.431961, 101.400681, 'ลานจอดรถ', 1, '5'),
(141, 14.435548, 101.414360, 'น้ำตกเหวสุวัต', 1, '3'),
(142, 14.434853, 101.414680, 'ลานจอดรถ', 1, '5'),
(143, 14.434904, 101.415123, 'ร้านอาหารน้ำตกเหวสุวัต', 1, '15'),
(144, 14.434441, 101.414970, 'เส้นทางศึกษาธรรมชาติเหวสุวัต-ผากล้วยไม้', 1, '13'),
(145, 14.434473, 101.414764, 'ห้องสุขาหญิง', 1, '12'),
(146, 14.434499, 101.414574, 'ห้องสุขาชาย', 1, '12'),
(147, 14.420486, 101.371017, 'ลานจอดรถ', 1, '5'),
(148, 14.411540, 101.374100, 'บ้านพักรับรองศูนย์ฝึกอบรมที่ 2', 1, '9'),
(149, 14.400378, 101.369141, 'บ้านพักโซน 4 (ธนะรัชต์)', 1, '9'),
(150, 14.382484, 101.390015, 'ศาลเจ้าพ่อเขาเขียว', 1, '10'),
(151, 14.365606, 101.406761, 'จุดชมวิวผาเดียวดาย', 1, '6'),
(152, 14.366636, 101.405647, 'เส้นทางศึกษาธรรมชาติผาเดียวดาย', 1, '13'),
(153, 14.366757, 101.405365, 'ลานจอดรถ', 1, '5'),
(154, 14.365795, 101.400703, 'ลานจอดรถ', 1, '5'),
(155, 14.365738, 101.400383, 'จุดชมวิวผาตรอมใจ', 1, '6'),
(156, 14.361846, 101.345306, 'ลานจอดรถ', 1, '5'),
(157, 14.363793, 101.345520, 'น้ำตกผาตะแบก', 1, '3'),
(158, 14.342459, 101.346039, 'ลานจอดรถ', 1, '5'),
(159, 14.313175, 101.377876, 'ลานจอดรถ', 1, '5'),
(160, 14.299016, 101.358467, 'น้ำตกผางามงอน', 1, '3'),
(161, 14.311398, 101.350723, 'น้ำตกคลองคราม', 1, '3'),
(162, 14.319985, 101.338600, 'น้ำตกเขาช่องลม', 1, '3'),
(163, 14.328967, 101.318710, 'น้ำตกนางรอง', 1, '3'),
(164, 14.308966, 101.255150, 'น้ำตกสาริกา', 1, '3'),
(165, 14.289836, 101.388062, 'น้ำตกเหวนรก', 1, '3'),
(166, 14.294149, 101.395317, 'ลานจอดรถ', 1, '5'),
(167, 14.286616, 101.393684, 'ลานจอดรถ', 1, '5'),
(168, 14.267082, 101.385292, 'ลานจอดรถ', 1, '5'),
(169, 14.266813, 101.386063, 'จุดชมวิว', 1, '6'),
(170, 14.251465, 101.382164, 'ลานจอดรถ', 1, '5'),
(171, 14.251350, 101.381866, 'น้ำตกธารรัตนา', 1, '3'),
(172, 14.222202, 101.405693, 'ด่านเนินหอม', 1, '11'),
(173, 14.223692, 101.405548, 'ลานจอดรถ', 1, '5'),
(174, 14.223683, 101.405312, 'ห้องสุขา', 1, '12'),
(175, 14.223875, 101.405312, 'ศูนย์บริการนักท่องเที่ยว', 1, '4'),
(176, 14.197160, 101.543198, 'น้ำตกธารทิพย์', 1, '3'),
(177, 14.181849, 101.592636, 'น้ำตกตะคร้อ', 1, '3'),
(178, 14.183846, 101.718636, 'น้ำตกแก่งหินเพิง', 1, '3'),
(193, 14.482155, 101.383667, 'ตรงนี้อัตรายมากโปรลดความเร็ว', 1, '2'),
(198, 14.265930, 101.388252, 'มีสัญญาณ', 1, '0'),
(199, 14.277160, 101.384277, 'มีสัญญาณ', 1, '0'),
(200, 14.283460, 101.393387, 'มีสัญญาณ', 1, '0'),
(201, 14.286630, 101.394302, 'มีสัญญาณ', 1, '0'),
(202, 14.297140, 101.393318, 'มีสัญญาณ', 1, '0'),
(203, 14.301320, 101.386620, 'มีสัญญาณ', 1, '0'),
(204, 14.315670, 101.378029, 'มีสัญญาณ', 1, '0'),
(205, 14.334800, 101.354424, 'มีสัญญาณ', 1, '0'),
(206, 14.343790, 101.344398, 'มีสัญญาณ', 1, '0'),
(207, 14.365330, 101.347549, 'มีสัญญาณ', 1, '0'),
(208, 14.368950, 101.347900, 'มีสัญญาณ', 1, '0'),
(209, 14.401910, 101.365929, 'มีสัญญาณ', 1, '0'),
(210, 14.407050, 101.369492, 'มีสัญญาณ', 1, '0'),
(211, 14.423820, 101.372223, 'มีสัญญาณ', 1, '0'),
(212, 14.437640, 101.372131, 'มีสัญญาณ', 1, '0'),
(213, 14.444480, 101.369324, 'มีสัญญาณ', 1, '0'),
(214, 14.462180, 101.371140, 'มีสัญญาณ', 1, '0'),
(215, 14.475200, 101.386719, 'มีสัญญาณ', 1, '0'),
(216, 14.473220, 101.390747, 'มีสัญญาณ', 1, '0'),
(217, 14.483370, 101.386040, 'มีสัญญาณ', 1, '0'),
(218, 14.488370, 101.387260, 'มีสัญญาณ', 1, '0'),
(219, 14.496530, 101.384850, 'มีสัญญาณ', 1, '0'),
(220, 14.505980, 101.379829, 'มีสัญญาณ', 1, '0'),
(221, 14.473630, 101.388840, 'มีสัญญาณ', 1, '0'),
(222, 14.464910, 101.372398, 'มีสัญญาณ', 1, '0'),
(223, 14.459250, 101.371902, 'มีสัญญาณ', 1, '0'),
(224, 14.434010, 101.374733, 'มีสัญญาณ', 1, '0'),
(225, 14.431390, 101.380272, 'มีสัญญาณ', 1, '0'),
(226, 14.423990, 101.386276, 'มีสัญญาณ', 1, '0'),
(227, 14.430350, 101.399361, 'มีสัญญาณ', 1, '0'),
(228, 14.433440, 101.399452, 'มีสัญญาณ', 1, '0'),
(229, 14.403800, 101.374069, 'มีสัญญาณ', 1, '0'),
(230, 14.398890, 101.379387, 'มีสัญญาณ', 1, '0'),
(231, 14.393100, 101.384720, 'มีสัญญาณ', 1, '0'),
(232, 14.385040, 101.385277, 'มีสัญญาณ', 1, '0'),
(233, 14.381970, 101.391708, 'มีสัญญาณ', 1, '0'),
(234, 14.377190, 101.397408, 'มีสัญญาณ', 1, '0'),
(235, 14.373700, 101.399727, 'มีสัญญาณ', 1, '0'),
(236, 14.374410, 101.408012, 'มีสัญญาณ', 1, '0'),
(237, 14.368420, 101.406212, 'มีสัญญาณ', 1, '0'),
(238, 14.365260, 101.400589, 'มีสัญญาณ', 1, '0'),
(239, 14.360160, 101.386063, 'มีสัญญาณ', 1, '0');

-- --------------------------------------------------------

--
-- Table structure for table `member`
--

DROP TABLE IF EXISTS `member`;
CREATE TABLE `member` (
  `UserID` int(3) NOT NULL,
  `Username` varchar(20) NOT NULL,
  `Password` varchar(255) NOT NULL,
  `Name` varchar(100) NOT NULL,
  `Lastname` varchar(50) NOT NULL,
  `Tel` varchar(10) DEFAULT 'NULL',
  `Email` varchar(150) NOT NULL,
  `Status` varchar(20) NOT NULL DEFAULT '''USER''',
  `SID` varchar(32) DEFAULT NULL,
  `Active` enum('Yes','No') NOT NULL DEFAULT 'No',
  `timestamp` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `member`
--

INSERT INTO `member` (`UserID`, `Username`, `Password`, `Name`, `Lastname`, `Tel`, `Email`, `Status`, `SID`, `Active`, `timestamp`) VALUES
(29, 'gieyazka', 'a', 'pokkate', 'eiampubyai', '0970963751', 'aomsin.akong@gmail.com', 'USER', 'ro854r9n51r26ktat40euip7a7', 'Yes', '2020-03-16 21:52:37'),
(30, 'employee', '11111111', 'pokkate', 'eiampubyai', '0955120247', 'pokket.1@gmail.com', 'employee', 'aaa', 'Yes', '2020-03-16 21:52:37'),
(76, 'admin', 'd3ab036a64bc0448b24a4e8c7e72e0802bce98a81d733183177e900b377d66d2', 'Pokkate', 'eiampubyai', '0955120247', '6106021410040@fitm.kmutnb.ac.th', 'admin', NULL, 'Yes', '2020-03-16 21:52:37'),
(83, '2728625530513820', '', 'pokkate', 'eiampubyai', '0955120247', 'pokket_1@hotmail.com', 'USER', 'un1v5ts4k9nnduvlj53tife99p', 'Yes', '2020-03-16 21:52:37'),
(84, '1030028797338236', 'FROMFacebook', 'pokkate', 'eiampubyai', '0955120247', 'yazka007@gmail.com', 'USER', 'uljljhaq8dti7uqfirhkd7sos5', 'Yes', '2020-03-16 21:52:37'),
(88, '4085268178157341', 'FROMFacebook', 'TeeColdly', 'TeeColdly', '', 'werttwer@hotmail.com', 'USER', '7lie32uemrt1bnhst5g7mdqte5', 'Yes', '2020-03-16 21:52:37'),
(89, '2611045545674678', 'FROMFacebook', 'Woravat', 'Yana', '', 'blackbow_b@hotmail.com', 'USER', '023drl3qj0jmido3ovmu61l0s3', 'Yes', '2020-03-16 21:52:37'),
(91, '2918005978242215', 'FROMFacebook', 'Suwitsit', 'Chatmongkolchart', '', 'jammam01@hotmail.com', 'USER', 'r5lauuqfsol42tclfevp21u9bd', 'Yes', '2020-03-16 21:52:37'),
(92, '1001967888390', 'FROMFacebook', 'Colonel', 'Sanders', '', 'colonelwaxsanders@gmail.com', 'USER', '52guen32ndkdbgb4bm14d73d33', 'Yes', '2020-03-16 21:52:37'),
(93, 'benz', '123456789', 'benzddd', 'benzaaa', '0818162107', '6106021410058@fitm.kmutnb.ac.th', 'USER', 'gr7idp1daotsm5sdi3sqakg8sg', 'Yes', '2020-03-16 21:52:37'),
(95, '2889033791147035', 'FROMFacebook', 'Prasittichai', 'Keawwan', '', 'benzaxza_@hotmail.com', 'USER', 'gr7idp1daotsm5sdi3sqakg8sg', 'Yes', '2020-03-16 21:52:37'),
(96, '2584653761583071', 'FROMFacebook', 'Dew', 'Nitinant', '', 'classic_dew_@hotmail.com', 'USER', '4r5qthohbge3kmrg10i5pknp3o', 'Yes', '2020-03-16 21:52:37'),
(98, 'Jamesdat', '#6wto9y3QxQ', 'Jamesdat', 'Jamesdat', 'Jamesdat', 's.z.y.m.anskiashley5@gmail.com', 'USER', '91v4o1h80o3jvvi15ankd7gdro', 'No', '2020-03-16 21:52:37'),
(99, '2788320641243523', 'FROMFacebook', 'Sutat', 'Suphaphol', '', 'boysutat26@gmail.com', 'USER', 'qmqdkd8m4kciugeg7hlp3j8073', 'Yes', '2020-03-16 21:52:37'),
(100, '1487836918037662', 'FROMFacebook', 'Jaruwan', 'Klomklom', '', 'jaruwan-klomklorm@hotmail.com', 'USER', 'sg3a4h54q5v5m9f3ee1d48ms77', 'Yes', '2020-03-16 21:52:37'),
(101, '2906850086044450', 'FROMFacebook', 'Pongtep', 'Vongsena', '', 'poyokee@gmail.com', 'USER', 'vdrhemc97s0qf926s2vqmbu1af', 'Yes', '2020-03-16 21:52:37'),
(102, '10216667064016130', 'FROMFacebook', 'Wsnee', 'Tree', '', 'wijittra.tr@gmail.com', 'USER', 'iho84jfl67v5jpdouu46tqsm8g', 'Yes', '2020-03-16 21:52:37'),
(103, '3058241130873360', 'FROMFacebook', 'Yupins', 'Suppakhun', '', 'yupin.s@fitm.kmutnb.ac.th', 'USER', 'e31v542dfb38kacoj7fa09672l', 'Yes', '2020-03-16 21:52:37'),
(104, 'employee01', '0955120247', 'prasithchai', 'kaewwan', '0818162107', 'benzdragond@gmail.com', 'employee', 'm1qjtavdk98o39hl04njesvd8u', 'Yes', '2020-03-16 21:52:37'),
(107, 'benzdragon01', '25f9e794323b453885f5181f1b624d0b8696054b2811313cf1b31864fa32d79a', 'Benzddd', 'Gggggg', '0818162107', 'benzaxza@gmail.com', 'employee', 'h4c86rjf8g6jlnda9laj1l8b5h', 'Yes', '2020-03-19 15:43:37');

-- --------------------------------------------------------

--
-- Table structure for table `user_position`
--

DROP TABLE IF EXISTS `user_position`;
CREATE TABLE `user_position` (
  `user_position_id` int(11) NOT NULL,
  `username` varchar(50) NOT NULL,
  `Name` varchar(255) NOT NULL,
  `Lastname` varchar(255) NOT NULL,
  `Password` varchar(255) NOT NULL,
  `Tel` varchar(10) NOT NULL,
  `Email` varchar(255) NOT NULL,
  `Status` varchar(20) NOT NULL,
  `Active` enum('Yes','No') NOT NULL DEFAULT 'No',
  `user_latitude` float DEFAULT NULL,
  `user_longitude` float DEFAULT NULL,
  `timestamp` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Dumping data for table `user_position`
--

INSERT INTO `user_position` (`user_position_id`, `username`, `Name`, `Lastname`, `Password`, `Tel`, `Email`, `Status`, `Active`, `user_latitude`, `user_longitude`, `timestamp`) VALUES
(2, 'gieyazka', 'pokkate', 'eiampubyai', 'd3ab036a64bc0448b24a4e8c7e72e08018c04ffab2d3ed5b8013ea005bf20985', '0955120247', 'pokket.1@gmail.com', 'Ambulance', 'Yes', NULL, NULL, '2020-03-16 23:22:06');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `counter`
--
ALTER TABLE `counter`
  ADD PRIMARY KEY (`DATE`,`IP`);

--
-- Indexes for table `daily`
--
ALTER TABLE `daily`
  ADD PRIMARY KEY (`DATE`);

--
-- Indexes for table `help`
--
ALTER TABLE `help`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `locations`
--
ALTER TABLE `locations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `member`
--
ALTER TABLE `member`
  ADD PRIMARY KEY (`UserID`);

--
-- Indexes for table `user_position`
--
ALTER TABLE `user_position`
  ADD PRIMARY KEY (`user_position_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `help`
--
ALTER TABLE `help`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=314;

--
-- AUTO_INCREMENT for table `locations`
--
ALTER TABLE `locations`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=240;

--
-- AUTO_INCREMENT for table `member`
--
ALTER TABLE `member`
  MODIFY `UserID` int(3) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=108;

--
-- AUTO_INCREMENT for table `user_position`
--
ALTER TABLE `user_position`
  MODIFY `user_position_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
